# Hidden Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaCommon..::..Hidden Property
SchemaCommon Class See Also
---
The property labeled "Hidden" common to all visual Asset types.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string Hidden { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Hidden As String
	Get
```

Visual C++
---
```text
public:
static property String^ Hidden {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace